Revit 2024 API
WorksharingUtils.CheckoutWorksets Method
Overload List
Name | Description
CheckoutWorksets(Document, ICollection<WorksetId>)
 Obtains ownership for the current user of as many specified worksets as possible.
CheckoutWorksets(Document, ISet<WorksetId>, TransactWithCentralOptions)
 Obtains ownership for the current user of as many specified worksets as possible.
See Also
WorksharingUtils Class
WorksharingUtils Members
Autodesk.Revit.DB Namespace